anachrocomputer/PIC32DDS/DDS.X/dds.c
inline void oledData(const uint8_t d)
{
    static char data[2];
    
    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 1;  // DC HIGH
    
    data[0] = d;
    SPIwrite(data, 1);
}


/* oledCmd --- send a command byte to the OLED by fast hardware SPI */

inline void oledCmd(const uint8_t c)
{
    static char cmd[2];
    
    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 0;  // DC LOW
    
    cmd[0] = c;
    SPIwrite(cmd, 1);
}


/* updscreen --- update the physical screen from the buffer */

static void updscreen(void)
{
    static uint8_t addrCmd[] = {SSD1306_COLUMNADDR, 0, MAXX - 1, SSD1306_PAGEADDR, 0, 7};

    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 0;  // DC LOW
    
    SPIwrite(addrCmd, sizeof (addrCmd));
    
    while (SPIbytesPending() > 0)
        ;
    
    LATGbits.LATG9 = 1;  // DC HIGH
    
    SPIwrite(&Frame[0][0], MAXROWS * MAXX);
}


/* OLED_begin --- initialise the 128x64 OLED */

void OLED_begin(void)
{
    /* Configure I/O pins on PIC32 */
    TRISEbits.TRISE8 = 0;     // RE8, pin 18, P1 pin 22, as output for RES
    TRISGbits.TRISG9 = 0;     // RG9, pin 14, P1 pin 26, as output for DC

    LATEbits.LATE8 = 1;       // RES pin HIGH initially
    LATGbits.LATG9 = 1;       // DC pin HIGH initially

    /* Start configuring the SSD1306 OLED controller */
    delayms(1);
    LATEbits.LATE8 = 0;     // Hardware reset for 10ms
    delayms(10);
    LATEbits.LATE8 = 1;

    // Init sequence for 128x64 OLED module
    oledCmd(SSD1306_DISPLAYOFF);                    // 0xAE
    oledCmd(SSD1306_SETDISPLAYCLOCKDIV);            // 0xD5
    oledCmd(0x80);                                  // the suggested ratio 0x80
    oledCmd(SSD1306_SETMULTIPLEX);                  // 0xA8
    oledCmd(0x3F);
    oledCmd(SSD1306_SETDISPLAYOFFSET);              // 0xD3
    oledCmd(0x0);                                   // no offset
    oledCmd(SSD1306_SETSTARTLINE | 0x0);            // line #0
    oledCmd(SSD1306_CHARGEPUMP);                    // 0x8D
    oledCmd(0x14);
    oledCmd(SSD1306_MEMORYMODE);                    // 0x20
    oledCmd(0x00);                                  // 0x0 act like ks0108
    oledCmd(SSD1306_SEGREMAP | 0x1);
    oledCmd(SSD1306_COMSCANDEC);
    oledCmd(SSD1306_SETCOMPINS);                    // 0xDA
    oledCmd(0x12);
    oledCmd(SSD1306_SETCONTRAST);                   // 0x81
    oledCmd(0xCF);
    oledCmd(SSD1306_SETPRECHARGE);                  // 0xd9
    oledCmd(0xF1);
    oledCmd(SSD1306_SETVCOMDETECT);                 // 0xDB
    oledCmd(0x40);
    oledCmd(SSD1306_DISPLAYALLON_RESUME);           // 0xA4
    oledCmd(SSD1306_NORMALDISPLAY);                 // 0xA6

    oledCmd(SSD1306_DISPLAYON); // Turn on OLED panel
}


/* greyFrame --- clear entire frame to checkerboard pattern */

void greyFrame(void)
{
    int r, c;

    for (r = 0; r < MAXROWS; r++)
    {
        for (c = 0; c < MAXX; c += 2)
        {
            Frame[r][c] = 0xaa;
            Frame[r][c + 1] = 0x55;
        }
    }
}


/* PPS_begin --- map Peripheral Pin Select to suit dev board */

static void PPS_begin(void)
{
    /* Configure USART1 */
    RPE5Rbits.RPE5R = 3;    // U1Tx on pin 3, RPE5
    U1RXRbits.U1RXR = 10;   // U1Rx on pin 6, RPC1
    
    /* Configure USART2 */
    RPG0Rbits.RPG0R = 1;    // U2Tx on pin 90, RPG0
    U2RXRbits.U2RXR = 12;   // U2Rx on pin 89, RPG1 (5V tolerant)
    
    /* Configure USART3 */
    RPF1Rbits.RPF1R = 1;    // U3Tx on pin 88, RPF1
    U3RXRbits.U3RXR = 4;    // U3Rx on pin 87, RPF0
    
    /* Configure USART4 */
    RPD4Rbits.RPD4R = 2;    // U4Tx on pin 81, RPD4
    U4RXRbits.U4RXR = 6;    // U4Rx on pin 82, RPD5 (5V tolerant)
    
    /* Configure USART5 */
    RPD12Rbits.RPD12R = 4;  // U5Tx on pin 79, RPD12
    U5RXRbits.U5RXR = 0;    // U5Rx on pin 76, RPD1
    
    /* Configure OC pins (PWM) */
    RPD8Rbits.RPD8R = 12; // OC1 on P7 pin 10 (LED PWM)
    RPD0Rbits.RPD0R = 11; // OC2 on P7 pin 14 (tone)
    
    /* Configure SPI1 */
    // SCK1 on pin 70 RD10 - can't use on this PCB
    //SDI1Rbits.SDI1R = 0;   // SDI1 on RPD3
    //RPC13Rbits.RPC13R = 8; // SDO1 on RPC13
    
    /* Configure SPI2 */
    // SCK2 on pin 10, RG6, P1 pin 32
    SDI2Rbits.SDI2R = 0;   // SDI2 on RPD3, pin 78
    RPC13Rbits.RPC13R = 6; // SDO2 on RPC13, pin 73, P7 pin 16
    
    /* Configure SPI3 */
    // SCK3 on pin 39, RF13, P1 pin 15
    SDI3Rbits.SDI3R = 0;   // SDI3 on RPD2, pin 77
    RPG8Rbits.RPG8R = 14;  // SDO3 on RPG8, pin 12, P1 pin 28
    
    /* Configure SPI4 */
    // SCK4 on pin 48, RD15 blocked by Main current sense
    
    /* Configure I2C1 */
    // SCL1 on RA14, pin 66, P1 pin 19
    // SDA1 on RA15, pin 67, P1 pin 21
    
    /* Configure I2C2 */
    // SCL2 on RA2, pin 58, P7 pin 20
    // SDA2 on RA3, pin 59, P7 pin 22
}


/* TRIS_begin --- switch GPIO pins to input or output as required */

static void TRIS_begin(void)
{
    TRISEbits.TRISE6 = 0;   // LED1 pin 4 as output
    TRISEbits.TRISE7 = 0;   // LED2 pin 5 as output
    TRISEbits.TRISE1 = 0;   // LED3 pin 94 as output
    TRISAbits.TRISA7 = 0;   // LED4 pin 92 as output
    TRISAbits.TRISA6 = 0;   // LED5 pin 91 as output
    
    TRISGbits.TRISG15 = 0;  // U1EN pin 1 as output
    TRISEbits.TRISE2 = 0;   // U2EN pin 98 as output
    TRISGbits.TRISG12 = 0;  // U3EN pin 96 as output
    TRISDbits.TRISD13 = 0;  // U4EN pin 80 as output
    TRISDbits.TRISD11 = 0;  // U5EN pin 71 as output
    
    TRISEbits.TRISE3 = 1;   // U1FAULT pin 99 as input
    TRISGbits.TRISG13 = 1;  // U2FAULT pin 97 as input
    TRISGbits.TRISG14 = 1;  // U3FAULT pin 95 as input
    TRISDbits.TRISD3 = 1;   // U4FAULT pin 78 as input
    TRISDbits.TRISD10 = 1;  // U5FAULT pin 70 as input
    TRISFbits.TRISF5 = 1;   // Main current FAULT pin 50 as input
    TRISFbits.TRISF4 = 1;   // Motor current FAULT pin 49 as input
    
    ANSELEbits.ANSE4 = 1;   // U1 current sense pin 100, RE4, AN21, analog
    ANSELEbits.ANSE0 = 1;   // U2 current sense pin 93, RE0, AN46, analog
    ANSELDbits.ANSD7 = 1;   // U3 current sense pin 84, RD7, AN43, analog
    ANSELDbits.ANSD6 = 1;   // U4 current sense pin 83, RD6, AN42, analog
    ANSELDbits.ANSD2 = 1;   // U5 current sense pin 77, RD2, AN25, analog
    ANSELDbits.ANSD14 = 1;  // Main current sense pin 47, RD14, AN36, analog
    ANSELDbits.ANSD15 = 1;  // Motor current sense pin 48, RD15, AN37, analog (blocks SCK4)

    TRISEbits.TRISE4 = 1;   // U1 current sense pin 100, RE4, AN21, input
    TRISEbits.TRISE0 = 1;   // U2 current sense pin 93, RE0, AN46, input
    TRISDbits.TRISD7 = 1;   // U3 current sense pin 84, RD7, AN43, input
    TRISDbits.TRISD6 = 1;   // U4 current sense pin 83, RD6, AN42, input
    TRISDbits.TRISD2 = 1;   // U5 current sense pin 77, RD2, AN25, input
    TRISDbits.TRISD14 = 1;  // Main current sense pin 47, RD14, AN36, input
    TRISDbits.TRISD15 = 1;  // Motor current sense pin 48, RD15, AN37, input (blocks SCK4)
    
    TRISBbits.TRISB15 = 0;  // HV_EN pin 44 as output
    
