anachrocomputer/PIC32DDS/DDS.X/dds.c
    // TODO: Add head LEDs and Add-On ports on daughter board
    
    ANSELBbits.ANSB6 = 1;   // Pot on pin 26, P1-37, RB6, AN6 analog
    TRISBbits.TRISB6 = 1;   // Pot on pin 26, P1-37, RB6, AN6 input
    
    TRISAbits.TRISA4 = 0;   // RA4 pin 60, P7 pin 6 as output (timer toggle)
    TRISDbits.TRISD0 = 0;   // RD0 pin 72, P7 pin 14 as output (SYNC signal)
}


void main(void)
{
    char buf[32];
    int i;
    double delta;
    uint16_t ana;
    
    /* Set up peripherals to match pin connections on PCB */
    PPS_begin();
    
    /* Configure tri-state registers*/
    TRIS_begin();
    
    LATBbits.LATB15 = 0;  // HV_EN pin 44 LOW (6V regulator OFF)
    
    /* Switch off the MOSFETs */
    LATGbits.LATG15 = 0;  // U1EN pin 1 OFF
    LATEbits.LATE2 = 0;   // U2EN pin 98 OFF
    LATGbits.LATG12 = 0;  // U3EN pin 96 OFF
    LATDbits.LATD13 = 0;  // U4EN pin 80 OFF
    LATDbits.LATD11 = 0;  // U5EN pin 71 OFF
    
    UART1_begin(9600);
    UART2_begin(9600);
    UART3_begin(9600);
    UART4_begin(9600);
    UART5_begin(9600);

    ADC_begin();
    
    SPI2_begin(2000000);
    SPI3_begin(1000000);
    
    RPD8Rbits.RPD8R = 12; // OC1 on P7 pin 10 (LED PWM)
    
    /* Configure Timer 3 for 10-bit PWM */
    T3CONbits.TCKPS = 6;        // Timer 3 prescale: 64
    
    TMR3 = 0x00;                // Clear Timer 3 counter
    PR3 = 1023;                 // PWM range 0..1023 (10 bits)
    
    T3CONbits.ON = 1;           // Enable Timer 3
    
    OC1CONbits.OCTSEL = 1;      // Source: Timer 3
    OC1CONbits.OCM = 6;         // PWM mode
    
    OC1RS = 256;
    
    OC1CONbits.ON = 1;          // Enable OC1 PWM
            
    /* Configure Timer 1 */
    T1CONbits.TCKPS = 0;        // Timer 1 prescale: 1
    
    TMR1 = 0x00;                // Clear Timer 1 counter
    PR1 = 39999;                // Interrupt every 40000 ticks (1ms)
    
    T1CONbits.ON = 1;           // Enable Timer 1
    
    /* Configure Timer 4 */
    T4CONbits.TCKPS = 0;        // Timer 4 prescale: 1
    
    TMR4 = 0x00;                // Clear Timer 4 counter
    PR4 = 906;                  // Interrupt every 907 ticks (44100Hz)
    
    T4CONbits.ON = 1;           // Enable Timer 4
    
    /* Configure interrupts */
    INTCONSET = _INTCON_MVEC_MASK; // Multi-vector mode
    
    IPC1bits.T1IP = 2;          // Timer 1 interrupt priority 2
    IPC1bits.T1IS = 1;          // Timer 1 interrupt sub-priority 1
    IFS0CLR = _IFS0_T1IF_MASK;  // Clear Timer 1 interrupt flag
    IEC0SET = _IEC0_T1IE_MASK;  // Enable Timer 1 interrupt
    
    IPC4bits.T4IP = 4;          // Timer 4 interrupt priority 4
    IPC4bits.T4IS = 1;          // Timer 4 interrupt sub-priority 1
    IFS0CLR = _IFS0_T4IF_MASK;  // Clear Timer 4 interrupt flag
    IEC0SET = _IEC0_T4IE_MASK;  // Enable Timer 4 interrupt
    
    delta = (2.0 * M_PI) / 4096.0;
    
    for (i = 0; i < 4096; i++)
    {
        Sinbuf[i] = (sin(delta * (double)i) * 2047.0) + 2048.0;
    }
    
    __asm__("EI");              // Global interrupt enable
    
    OLED_begin();
    
    while(1)
    {
        U1TXREG = 'A';
        DDS_SetFreq(440);
        greyFrame();
    
        updscreen();
        
        LED1 = 0;
        LED2 = 1;
        LED3 = 1;
        LED4 = 1;
        LED5 = 1;
        
        OC1RS = 0;
        
        delayms(500);
        
        ana = analogRead(6);
        
        sprintf(buf, "%dms %d\r\n", millis(), ana);
        
        for (i = 0; buf[i] != '\0'; i++)
        {
            while (U2STAbits.UTXBF) // Wait while Tx buffer full
                ;
            
            U2TXREG = buf[i];
        }
        
        DDS_SetFreq(440 * 2);
        
        LED1 = 1;
        LED2 = 0;
        
        OC1RS = 128;
        
        delayms(500);
        memcpy(Frame, DdsLogo, sizeof (Frame));
    
        updscreen();
        
        U3TXREG = 'C';
        DDS_SetFreq(440 * 4);
        
        LED2 = 1;
        LED3 = 0;
        
        OC1RS = 256;
        
        delayms(500);
        
        U4TXREG = 'D';
        DDS_SetFreq(440 * 8);
        
        LED3 = 1;
        LED4 = 0;
        
        OC1RS = 512;
        
        delayms(500);
        
        U5TXREG = 'E';
        DDS_SetFreq(220);
        
        LED4 = 1;
        LED5 = 0;
        
        OC1RS = 1023;
        
        delayms(500);
    }
}

